# ==========================================
# ЭТАП 1: Сборка приложения (Builder)
# ==========================================
FROM golang:1.22-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы модулей для кэширования загрузки зависимостей
COPY go.mod go.sum ./
RUN go mod download

# Копируем весь исходный код
COPY . .

# Собираем приложение
RUN CGO_ENABLED=0 GOOS=linux go build -o /tracker-app .

# ==========================================
# ЭТАП 2: Финальный минимальный образ (Runner)
# ==========================================
FROM alpine:latest

WORKDIR /app

# Копируем только скомпилированный бинарный файл из этапа builder
COPY --from=builder /tracker-app .

# Команда, которая выполнится при запуске контейнера
CMD ["./tracker-app"]